s3/src/Catalogs/ТомаХраненияФайлов/ТомаХраненияФайлов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension" extendedConfigurationObject="d912e472-9553-4b96-8b16-7aaff6c14239">
  <name>ТомаХраненияФайлов</name>
  <objectBelonging>Adopted</objectBelonging>
  <extension>
    <hierarchical>Checked</hierarchical>
  </extension>
  <hierarchical>true</hierarchical>
  <attributes>
    <name>s3_ТипХранилища</name>
    <type>
      <types>EnumRef.s3_ТипыХранилищ</types>
    </type>
  </attributes>
  <attributes>
    <name>s3_АдресХранилища</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>s3_ИмяПрефикса</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>s3_ИмяПрефиксаРабочаяБаза</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>s3_ИдентификаторКлючаДоступа</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>s3_СекретныйКлюч</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>s3_Регион</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes extendedConfigurationObject="d03d5b18-57a2-43c0-99ea-8ad9d5788179">
    <name>ПолныйПутьWindows</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="9283277f-2b75-4c3a-810a-8d4071b3afcc">
    <name>ПолныйПутьLinux</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="8f5af22e-3e73-4a4f-b91e-eccd0f5084fd">
    <name>МаксимальныйРазмер</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="c491a7fc-14f9-498a-b7dd-575dfc66878e">
    <name>ПорядокЗаполнения</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <numberQualifiers>
          <precision>3</precision>
        </numberQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="b04018b5-a74d-43c9-8519-6cc8aa23fe09">
    <name>Комментарий</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
</mdclass:Catalog>

s3/src/CommonModules/ФайловыеФункции/Module.bsl
Процедура ДобавитьНаДискСУказаниемДлиныИмени(МаксимальнаяДлинаПолногоПути, СсылкаНаТом, Знач ПутьКТому, ДвоичныеДанные, ПутьКФайлуВТоме, ВремяИзмененияУниверсальное, НомерВерсии, ИмяБезРасширения, Расширение, РазмерФайла, Зашифрован, ДатаДляРазмещенияВТоме, ВерсияСсылка)
		
	Дата = ТекущаяДатаСеанса();
	Если ЗначениеЗаполнено(ДатаДляРазмещенияВТоме) Тогда
		Дата = ДатаДляРазмещенияВТоме;
	КонецЕсли;	
	// + #s3 Иванов А.Б. 12.01.2021
	пЭтоТипХранилища_ОбъектноеS3 = s3_API.ЭтоТипХранилища_ОбъектноеS3(СсылкаНаТом);
	
	Если пЭтоТипХранилища_ОбъектноеS3 тогда
		
		ПутьДня = Формат(Дата, "ДФ=ггггММдд"); 
		ПутьДня = s3_API.ДобавитьКонечныйРазделительПутиS3(ПутьДня);
		ПутьКТому = s3_API.ДобавитьКонечныйРазделительПутиS3(ПутьКТому);		
		
		ВТДопПараметры = Новый Структура();
		ВТДопПараметры.Вставить("СсылкаНаТом",СсылкаНаТом);
		ВТДопПараметры.Вставить("ПутьДня",ПутьДня);
		ВТДопПараметры.Вставить("ПутьКТому",ПутьКТому);
		ВТДопПараметры.Вставить("ВерсияСсылка",ВерсияСсылка);
		ВТДопПараметры.Вставить("Расширение",Расширение);
		ВТДопПараметры.Вставить("НомерВерсии",НомерВерсии);
		
		ИмяФайлаСПутем = s3_API.ПолучитьУникальноеИмяСПутем(ВТДопПараметры);	
		
		ПолноеИмяФайлаСПутем = ПутьКТому + ИмяФайлаСПутем;
		
		s3_API.ДобавитьФайлНаДискS3(СсылкаНаТом, ДвоичныеДанные, ПолноеИмяФайлаСПутем);
		
		ПутьКФайлуВТоме = ИмяФайлаСПутем;
		
		Возврат;
	КонецЕсли;
	// - #s3 Иванов А.Б. 12.01.2021
	ПутьДня = Формат(Дата, "ДФ=ггггММдд") + ПолучитьРазделительПути();

	// Добавляем слэш в конце, если его нет
	ПутьКТому = ОбщегоНазначенияКлиентСервер.ДобавитьКонечныйРазделительПути(
		ПутьКТому, ОбщегоНазначенияСУЗПовтИсп.ТипПлатформыСервера());
	
	ДопустимаяДлинаИмениФайла = МаксимальнаяДлинаПолногоПути - СтрДлина(ПутьКТому)
	- СтрДлина(Расширение) - СтрДлина(Строка(НомерВерсии)) - СтрДлина(ПутьДня);

	Если Зашифрован Тогда
		ДопустимаяДлинаИмениФайла = ДопустимаяДлинаИмениФайла - 4;
	КонецЕсли;	

	ИмяБезРасширенияПроверенное = СокрЛП(ИмяБезРасширения);
	ИмяБезРасширенияПроверенное = 
	ОбщегоНазначенияКлиентСервер.ЗаменитьНедопустимыеСимволыВИмениФайла(ИмяБезРасширенияПроверенное, "");

	ИмяБезРасширенияУрезанное = ИмяБезРасширенияПроверенное;	

	СлучайнаяДобавкаИмениФайла = ПолучитьСлучайнуюДобавкуИмениФайла();
	ДлинаПрибавки = СтрДлина(СлучайнаяДобавкаИмениФайла) + 1;
	ДобавитьУникальныйИдентификатор = Истина;
	Если ДлинаПрибавки >= ДопустимаяДлинаИмениФайла Тогда
		ДобавитьУникальныйИдентификатор = Ложь;
	Иначе	
		ДопустимаяДлинаИмениФайла = ДопустимаяДлинаИмениФайла - ДлинаПрибавки;
	КонецЕсли;	

	Если СтрДлина(ИмяБезРасширенияУрезанное) > ДопустимаяДлинаИмениФайла Тогда
		ИмяБезРасширенияУрезанное = Лев(ИмяБезРасширенияУрезанное, ДопустимаяДлинаИмениФайла);
	КонецЕсли;
	Если ДобавитьУникальныйИдентификатор Тогда
		ИмяБезРасширенияУрезанное = ИмяБезРасширенияУрезанное + "_" + СлучайнаяДобавкаИмениФайла;
	КонецЕсли;	

	// Имя файла для хранения на диске формировать следующим образом
	// - имя файла.номер версии.расширение файла
	Если ПустаяСтрока(НомерВерсии) Тогда
		ИмяФайла = ИмяБезРасширенияУрезанное + "." + Расширение;
	Иначе
		ИмяФайла = ИмяБезРасширенияУрезанное + "." + НомерВерсии + "." + Расширение;
	КонецЕсли;

	Если Зашифрован Тогда
		ИмяФайла = ИмяФайла + "." + "p7m";
	КонецЕсли;	

	// Если МаксимальныйРазмер = 0 - нет ограничения на размер файлов на томе
	Если СсылкаНаТом.МаксимальныйРазмер <> 0 Тогда
		ТекущийРазмерВБайтах = ФайловыеФункцииПовтИсп.ПодсчитатьРазмерФайловНаТоме(СсылкаНаТом.Ссылка); 
		НовыйРазмерВБайтах = ТекущийРазмерВБайтах + РазмерФайла;
		НовыйРазмер = НовыйРазмерВБайтах / (1024 * 1024);

		Если НовыйРазмер > СсылкаНаТом.МаксимальныйРазмер Тогда
			СтрокаОшибки 
			= СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
			НСтр("ru = 'Превышен максимальный размер тома (%1 Мб)!'"),
			СсылкаНаТом.МаксимальныйРазмер);
			ВызватьИсключение(СтрокаОшибки);
		КонецЕсли;
	КонецЕсли;

	ПутьКТому = ПутьКТому + ПутьДня;
	
	ИмяФайлаСПутем = ФайловыеФункцииКлиентСервер.ПолучитьУникальноеИмяСПутем(
		ПутьКТому, ИмяФайла, ОбщегоНазначенияСУЗПовтИсп.ТипПлатформыСервера());	

	Если ПустаяСтрока(ИмяФайлаСПутем) Тогда // не смогли добавить файл

		УникальныйИдентификатор = Новый УникальныйИдентификатор;
		УникальныйИдентификаторСтрока = Строка(УникальныйИдентификатор);
		ИмяФайла = СтрЗаменить(ИмяФайла, ИмяБезРасширенияУрезанное, УникальныйИдентификаторСтрока);
		// повторно получаем
		ИмяФайлаСПутем = ФайловыеФункцииКлиентСервер.ПолучитьУникальноеИмяСПутем(
		ПутьКТому, ИмяФайла, ОбщегоНазначенияСУЗПовтИсп.ТипПлатформыСервера());
		Если ПустаяСтрока(ИмяФайлаСПутем) Тогда // не смогли добавить файл

			СтрокаОшибки 
			= СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
			НСтр("ru = 'Не удалось получить полное имя файла для размещения на томе (файл ""%1"").'"),
			ИмяФайла);

			ВызватьИсключение(СтрокаОшибки);

		КонецЕсли;	
		
	КонецЕсли;	

	ПолноеИмяФайлаСПутем = ПутьКТому + ИмяФайлаСПутем;

	Если ТипЗнч(ДвоичныеДанные) = Тип("ДвоичныеДанные") Тогда
		ДвоичныеДанные.Записать(ПолноеИмяФайлаСПутем);
	ИначеЕсли ТипЗнч(ДвоичныеДанные) = Тип("Строка") Тогда // считаем, что иначе это путь к файлу на диске
		КопироватьФайл(ДвоичныеДанные, ПолноеИмяФайлаСПутем);
	Иначе
		СтрокаИсключения = НСтр("ru = 'Неверный тип данных для добавления на том'");
		ВызватьИсключение(СтрокаИсключения);
	КонецЕсли;

	// Установим время изменения файла таким, как оно стоит в текущей версии
	ФайлНаДиске = Новый Файл(ПолноеИмяФайлаСПутем);
	ФайлНаДиске.УстановитьУниверсальноеВремяИзменения(ВремяИзмененияУниверсальное);
	ФайлНаДиске.УстановитьТолькоЧтение(Истина);

	ПутьКФайлуВТоме = ПутьДня + ИмяФайлаСПутем;	
	
КонецПроцедуры

&ИзменениеИКонтроль("ПолныйПутьТома")
Функция s3_ПолныйПутьТома(СсылкаНаТом)
	
	#Вставка
	// + #s3 Иванов А.Б. 12.01.2021
	Если s3_API.ЭтоТипХранилища_ОбъектноеS3(СсылкаНаТом) Тогда
		Возврат s3_API.ПолныйПутьТома(СсылкаНаТом);
	КонецЕсли;
	// - #s3 Иванов А.Б. 12.01.2021
	#КонецВставки
	ТипПлатформыСервера = ТипПлатформыСервера();	
	
	Если ТипПлатформыСервера = ТипПлатформы.Windows_x86 ИЛИ ТипПлатформыСервера = ТипПлатформы.Windows_x86_64 Тогда
		Возврат СсылкаНаТом.ПолныйПутьWindows;
	Иначе	
		Возврат СсылкаНаТом.ПолныйПутьLinux;
	КонецЕсли;
	
КонецФункции // - #s3 Иванов А.Б. 12.01.2021


&Вместо("ДобавитьНаДиск")
Процедура s3_ДобавитьНаДиск(
		ДвоичныеДанные,
		ПутьКФайлуВТоме,
		СсылкаНаТом,
		ВремяИзмененияУниверсальное,
		НомерВерсии,
		ИмяБезРасширения,
		Расширение,
		РазмерФайла = 0,
		Зашифрован = Ложь,
		ДатаДляРазмещенияВТоме = Неопределено,
		ВерсияСсылка = Неопределено) Экспорт

	СсылкаНаТом = Справочники.ТомаХраненияФайлов.ПустаяСсылка();
	
	ОписаниеВсехОшибок = ""; // здесь соберем ошибки со всех томов
	
	ТаблицаТомов = Новый ТаблицаЗначений;
	
	Если Не РаботаСФайламиВызовСервера.ИспользоватьРазмещениеВТомахПоУсловиям()
		Или ВерсияСсылка = Неопределено Тогда
	
		Запрос = Новый Запрос;
		Запрос.Текст = 
			"ВЫБРАТЬ
			|	ТомаХраненияФайлов.Ссылка
			|ИЗ
			|	Справочник.ТомаХраненияФайлов КАК ТомаХраненияФайлов
			|ГДЕ
			|	ТомаХраненияФайлов.ПометкаУдаления = ЛОЖЬ
			|	И ТомаХраненияФайлов.ЭтоГруппа = ЛОЖЬ
			|
			|УПОРЯДОЧИТЬ ПО
			|	ТомаХраненияФайлов.ПорядокЗаполнения";

		ТаблицаТомов = Запрос.Выполнить().Выгрузить();
		
		Если ТаблицаТомов.Количество() = 0 Тогда
			ВызватьИсключение(НСтр("ru = 'Нет ни одного тома для размещения файла.'"));
		КонецЕсли;
		
	Иначе // размещение по условиям
		
		ГруппаТомов = ВыбратьГруппуТомовДляРазмещенияВерсии(ВерсияСсылка);
		ТаблицаТомов = ПолучитьСписокТомовВГруппе(ГруппаТомов);
		
		Если ТаблицаТомов.Количество() = 0 Тогда
			
			ТекстОшибки = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
				НСтр("ru = 'В группе томов ""%1"" нет ни одного тома для размещения файла'"),
				Строка(ГруппаТомов));
			
			ВызватьИсключение(ТекстОшибки);
			
		КонецЕсли;
		
	КонецЕсли;
	
	МаксимальнаяДлинаПолногоПути = 253; // 260-7 - 7 оставляем на \A1 \B2 и пр.
	
	Для Каждого СтрокаТома Из ТаблицаТомов Цикл
		
		СсылкаНаТом = СтрокаТома.Ссылка;
		ПутьКТому = ПолныйПутьТома(СсылкаНаТом);
		
		Попытка
			
			// делаем 3 попытки.  253, 126, 63.
			Попытка
				ДобавитьНаДискСУказаниемДлиныИмени(
					МаксимальнаяДлинаПолногоПути, СсылкаНаТом, ПутьКТому,
					ДвоичныеДанные, ПутьКФайлуВТоме, ВремяИзмененияУниверсальное,
					НомерВерсии, ИмяБезРасширения, Расширение, РазмерФайла, Зашифрован,
					ДатаДляРазмещенияВТоме, ВерсияСсылка);
			Исключение
				
				Попытка
					МаксимальнаяДлинаПолногоПути = Цел(МаксимальнаяДлинаПолногоПути / 2);
					ДобавитьНаДискСУказаниемДлиныИмени(
						МаксимальнаяДлинаПолногоПути, СсылкаНаТом, ПутьКТому,
						ДвоичныеДанные, ПутьКФайлуВТоме, ВремяИзмененияУниверсальное,
						НомерВерсии, ИмяБезРасширения, Расширение, РазмерФайла, Зашифрован,
						ДатаДляРазмещенияВТоме, ВерсияСсылка);
				Исключение	
					
					МаксимальнаяДлинаПолногоПути = Цел(МаксимальнаяДлинаПолногоПути / 2);
					ДобавитьНаДискСУказаниемДлиныИмени(
						МаксимальнаяДлинаПолногоПути, СсылкаНаТом, ПутьКТому,
						ДвоичныеДанные, ПутьКФайлуВТоме, ВремяИзмененияУниверсальное,
						НомерВерсии, ИмяБезРасширения, Расширение, РазмерФайла, Зашифрован,
						ДатаДляРазмещенияВТоме, ВерсияСсылка);
					
				КонецПопытки;	
				
			КонецПопытки;	
			
			Возврат; // успешно закончили - выйдем из процедуры
			
		Исключение
			
			ИнформацияОбОшибке = ИнформацияОбОшибке();
			
			Если ОписаниеВсехОшибок <> "" Тогда
				ОписаниеВсехОшибок = ОписаниеВсехОшибок + Символы.ПС + Символы.ПС;
			КонецЕсли;
			
			ШаблонОписанияОшибки =
				НСтр("ru = 'Ошибка при добавлении файла ""%1""
				           |в том ""%2"" (%3):
				           |""%4"".'");
			
			ИмяДляЛога = ИмяБезРасширения + "." + Расширение;
						   
			ОписаниеВсехОшибок = ОписаниеВсехОшибок + 
				СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
					ШаблонОписанияОшибки,
					ИмяДляЛога,
					Строка(СсылкаНаТом),
					ПутьКТому,
					ПодробноеПредставлениеОшибки(ИнформацияОбОшибке));
			
			Если СсылкаНаТом.ПолныйПутьLinux = СсылкаНаТом.ПолныйПутьWindows Тогда
				ОписаниеВсехОшибок = ОписаниеВсехОшибок + Символы.ПС;
				ОписаниеВсехОшибок = ОписаниеВсехОшибок + НСтр("ru = 'Настройте полный путь к тому.'");
			КонецЕсли;
			// надо переходить к следующему тому
			Продолжить;
		КонецПопытки;
		
	КонецЦикла;
	
	// запись в журнал регистрации для администратора
	// здесь выдадим ошибки со всех томов
	СообщениеОбОшибке = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
		НСтр("ru = 'Не удалось добавить файл ни в один из томов! Список ошибок: 
		|
		|%1'"),
		ОписаниеВсехОшибок);
	ЗаписьЖурналаРегистрации("Добавление файла", УровеньЖурналаРегистрации.Ошибка, , , СообщениеОбОшибке);
	
	// Сообщение обычному пользователю.
	СтрокаИсключения = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
		НСтр("ru = 'Не удалось добавить файл:
		           |""%1.%2"".
		           |
		           |Обратитесь к администратору.'"),
		ИмяБезРасширения, Расширение);
			 
	Если Пользователи.ЭтоПолноправныйПользователь(,,Ложь) Тогда
		СтрокаИсключения = СообщениеОбОшибке;	
	КонецЕсли;	 
			 
	ВызватьИсключение(СтрокаИсключения);

	ПродолжитьВызов(ДвоичныеДанные, ПутьКФайлуВТоме, СсылкаНаТом, ВремяИзмененияУниверсальное, НомерВерсии, ИмяБезРасширения, Расширение, РазмерФайла, Зашифрован, ДатаДляРазмещенияВТоме, ВерсияСсылка);
КонецПроцедуры
